## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                   |
|--------|--------------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.logs-1-scanfiles-timeout-1-minute-warning`  |
| delete | `aws_cloudwatch_metric_alarm.logs-3-scanfiles-timeout-5-minutes-warning` |
| update | `aws_cloudwatch_metric_alarm.logs-1-bounce-rate-1-minute-critical`       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.logs-1-bounce-rate-1-minute-critical will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "logs-1-bounce-rate-1-minute-critical" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-critical",
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        id                        = "logs-1-critical-bounce-rate-1-minute-warning"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.logs-1-scanfiles-timeout-1-minute-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "logs-1-scanfiles-timeout-1-minute-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One scanfiles timeout detected error in 1 minute"
      + alarm_name                            = "logs-3-scanfiles-timeout-5-minutes-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "scanfiles-timeout"
      + namespace                             = "LogMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.logs-3-scanfiles-timeout-5-minutes-warning will be destroyed
  # (because aws_cloudwatch_metric_alarm.logs-3-scanfiles-timeout-5-minutes-warning is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "logs-3-scanfiles-timeout-5-minutes-warning" {
      - actions_enabled           = true -> null
      - alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ] -> null
      - alarm_description         = "Three scanfiles timeout detected error in 5 minutes" -> null
      - alarm_name                = "logs-3-scanfiles-timeout-5-minutes-warning" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:296255494825:alarm:logs-3-scanfiles-timeout-5-minutes-warning" -> null
      - comparison_operator       = "GreaterThanOrEqualToThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "logs-3-scanfiles-timeout-5-minutes-warning" -> null
      - insufficient_data_actions = [] -> null
      - metric_name               = "scanfiles-timeout" -> null
      - namespace                 = "LogMetrics" -> null
      - ok_actions                = [] -> null
      - period                    = 300 -> null
      - statistic                 = "Sum" -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - threshold                 = 4 -> null
      - treat_missing_data        = "notBreaching" -> null
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-beat-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.celery-pods-high-cpu-warning"]
WARN -...
```

</details>
